#include "common.h"

typedef s32 (*XHumungusFunc)(UNK_PTR);

typedef struct XGiantMountain {
    /* 0x0000 */ u8 unk_00;
    /* 0x0001 */ char unk_01[0x100F];
    /* 0x1010 */ s32* unk_1010;
    /* 0x1014 */ char unk_1004[0x205C];
    /* 0x3070 */ u64 unk_3070;
    /* 0x3078 */ u64 unk_3078;
    /* 0x3080 */ char unk_3080[12];
    /* 0x308C */ s32 unk_308C;
    /* 0x3090 */ s32 unk_3090;
    /* 0x3094 */ char unk_3094[172];
    /* 0x3140 */ s32 unk_3140;
    /* 0x3140 */ s32* unk_3144;
    /* 0x3148 */ s32 unk_3148;
    /* 0x315C */ s32 unk_314C;
    /* 0x315C */ s32 unk_3150;
    /* 0x3148 */ char unk_3154[8];
    /* 0x315C */ s32 unk_315C;
    /* 0x3160 */ s32 unk_3160;
    /* 0x3164 */ s32 unk_3164;
    /* 0x3168 */ s32 unk_3168;
    /* 0x316C */ s32 unk_316C;
    /* 0x3170 */ s32 unk_3170;
    /* 0x3174 */ s32 unk_3174;
    /* 0x3178 */ char unk_3178[0x208];
    /* 0x3380 */ s32 unk_3380;
} XGiantMountain;
